
## Plan Result (perftest)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.test-secret
* Update
  * module.plum-redis-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.test-secret will be created
  + resource "azurerm_key_vault_secret" "test-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/plum-shared-infrastructure-perftest/providers/Microsoft.KeyVault/vaults/plumsi-perftest"
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/plum-recipe-backend-session-storage-cache-perftest/providers/Microsoft.Cache/redis/plum-recipe-backend-session-storage-perftest"
        name                          = "plum-recipe-backend-session-storage-perftest"
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "testing"
            "managedBy"           = "CNP"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":950,"Program":"tfcmt","SHA1":"","Target":"perftest","Vars":{}} -->